
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 17 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_connection_string
* Update
  * azurerm_application_insights.appinsights
  * azurerm_resource_group.rg
  * module.div-aos-overdue-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-bulk-print-config-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-bulkcase-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-data-extraction-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-fe-performance-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-server-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0]
  * module.div-vault.azurerm_key_vault.kv
  * module.div-vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.div-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.div-vault.azurerm_user_assigned_identity.managed_identity[0]
  * module.divorce-action-group.azurerm_resource_group_template_deployment.action-group
  * module.divorce-action-group2.azurerm_resource_group_template_deployment.action-group
  * module.redis.azurerm_private_endpoint.this[0]
  * module.redis.azurerm_redis_cache.redis
  * module.redis.azurerm_resource_group.cache-resourcegroup[0]
* Replace
  * azurerm_key_vault_secret.redis_connection_string


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault.div_key_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "div_key_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "div-aat"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "div-aat"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_application_insights.appinsights will be updated in-place
  ~ resource "azurerm_application_insights" "appinsights" {
        id                                    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Insights/components/div-aat"
        name                                  = "div-aat"
      ~ tags                                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat"
      + name                    = "app-insights-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_connection_string must be replaced
-/+ resource "azurerm_key_vault_secret" "redis_connection_string" {
      - content_type            = "" -> null
      ~ id                      = "https://div-aat.vault.azure.net/secrets/redis-connection-string/b0bfd05dec9546eaa3eaf2a062c32a9d" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat" -> (known after apply) # forces replacement
        name                    = "redis-connection-string"
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat/secrets/redis-connection-string/versions/b0bfd05dec9546eaa3eaf2a062c32a9d" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat/secrets/redis-connection-string" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "b0bfd05dec9546eaa3eaf2a062c32a9d" -> (known after apply)
      ~ versionless_id          = "https://div-aat.vault.azure.net/secrets/redis-connection-string" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat"
        name     = "div-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.div-aos-overdue-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-aos-overdue-alert"
        name                = "div-aos-overdue-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0=" -> "eyJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJhdXRvU2h1dGRvd24iOiJ0cnVlIiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL2Rpdi1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNkaXYtZGV2IiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiRGl2b3JjZSJ9"
                }
                # (13 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.div-bulk-print-config-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-bulk-print-config-errors-alert"
        name                = "div-bulk-print-config-errors-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0=" -> "eyJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJhdXRvU2h1dGRvd24iOiJ0cnVlIiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL2Rpdi1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNkaXYtZGV2IiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiRGl2b3JjZSJ9"
                }
                # (13 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.div-bulkcase-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-bulkcase-errors"
        name                = "div-bulkcase-errors"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0=" -> "eyJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJhdXRvU2h1dGRvd24iOiJ0cnVlIiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL2Rpdi1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNkaXYtZGV2IiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiRGl2b3JjZSJ9"
                }
                # (13 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.div-data-extraction-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-data-extraction-alert"
        name                = "div-data-extraction-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0=" -> "eyJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJhdXRvU2h1dGRvd24iOiJ0cnVlIiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL2Rpdi1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNkaXYtZGV2IiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiRGl2b3JjZSJ9"
                }
                # (13 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.div-fe-performance-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-fe-performance-alert"
        name                = "div-fe-performance-alert"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0=" -> "eyJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJhdXRvU2h1dGRvd24iOiJ0cnVlIiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL2Rpdi1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNkaXYtZGV2IiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiRGl2b3JjZSJ9"
                }
                # (13 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.div-server-errors-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-server-errors"
        name                = "div-server-errors"
      ~ parameters_content  = jsonencode(
          ~ {
              ~ commonTags               = {
                  ~ value = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvZGl2LXNoYXJlZC1pbmZyYXN0cnVjdHVyZS5naXQiLCJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjaGFuZ2VVcmwiOiIiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2Rpdi1kZXYiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJtYW5hZ2VkQnkiOiJEaXZvcmNlIn0=" -> "eyJhcHBsaWNhdGlvbiI6ImRpdm9yY2UiLCJhdXRvU2h1dGRvd24iOiJ0cnVlIiwiYnVpbHRGcm9tIjoiaHR0cHM6Ly9naXRodWIuY29tL0hNQ1RTL2Rpdi1zaGFyZWQtaW5mcmFzdHJ1Y3R1cmUuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNkaXYtZGV2IiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiRGl2b3JjZSJ9"
                }
                # (13 unchanged elements hidden)
            }
        )
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged elements hidden)
                    }
                }
                # (4 unchanged elements hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.div-vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat"
        name                            = "div-aat"
      ~ tags                            = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.div-vault.azurerm_key_vault_access_policy.creator_access_policy will be updated in-place
  ~ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
        id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat/objectId/ca6d5085-485a-417d-8480-c3cefa29df31"
      ~ key_permissions         = [
            # (13 unchanged elements hidden)
            "Verify",
          + "GetRotationPolicy",
        ]
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.div-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.KeyVault/vaults/div-aat|div-aat"
        name                       = "div-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.div-vault.azurerm_user_assigned_identity.managed_identity[0] will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "managed_identity" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/div-aat-mi"
        name                = "div-aat-mi"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.divorce-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-support"
        name                     = "div-support"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.divorce-action-group2.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-aat/providers/Microsoft.Resources/deployments/div-support2"
        name                     = "div-support2"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged element hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged elements hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.redis.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat/providers/Microsoft.Network/privateEndpoints/div-aat"
        name                     = "div-aat"
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat/providers/Microsoft.Cache/redis/div-aat"
        name                          = "div-aat"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (21 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.redis.azurerm_resource_group.cache-resourcegroup[0] will be updated in-place
  ~ resource "azurerm_resource_group" "cache-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/div-cache-aat"
        name     = "div-cache-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git" -> null
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/div-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 17 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":87,"Program":"tfcmt","SHA1":"","Vars":{}} -->